#include <stdio.h>

// 8. 3-р сарын календарыг хэвлэ. 3-р сарын нийтийн амралтын өдрийн ард тэмдэглэгээ
// хийнэ. Жишээ нь: 3-р сарын 8-ны өдөр нь нийтийн амралт гэвэл 8* гэх мэтээр
// тэмдэглэнэ. Давталтыг заавал ашиглана. Жишээ нь дараах зурагтай төстэй хэвлэнэ.
// break эсвэл continue операторыг давталт хийх үед ашиглана.

void main() {
    int startDay = 6;   
    int day = 1;
    int col = 0;

    while (1) {
        if (day > 31) {
            break;              
        }

        if (day == 8) {
            printf("%d*  ", day);   
        } else {
            printf("%d  ", day);
        }

        col++;
        if (col == 7) {       
            printf("\n");
            col = 0;
        }
        day++;
    }
    printf("\n");
}